Revit 2024 API
ElectricalAnalyticalNode.NodeType Property
 The type of electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElectricalAnalyticalNodeType NodeType { get; }
Visual Basic
Public ReadOnly Property NodeType As ElectricalAnalyticalNodeType
	Get
Visual C++
public:
property ElectricalAnalyticalNodeType NodeType {
	ElectricalAnalyticalNodeType get ();
}
See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace